{
  "courses": [
    {
      "id": "1",
      "name": "Osnove programiranja",
      "date": "01.04.2025",
      "duration": "20",
      "price": "250",
      "details": "Ukoliko i Vi želite karijeru u IT sektoru a pitate se odakle uopšte početi, kako je najlakše naučiti programiranje i da li je teško savladati programiranje, ukoliko želite da načinite prvi korak i uđete u svet informacionih tehnologija, SmartInIt kursevi programiranja su pravi izbor za Vas."
    },
    {
      "id": "2",
      "name": "Napredno programiranje",
      "date": "01.04.2025",
      "duration": "20",
      "price": "250",
      "details": "SmartInIT kurs naprednog programiranja namenjen je osobama koje su se već susretale sa programiranjem, poznaju osnove programiranja i koje žele da napreduju učeći objektno orijentisano programiranje"
    },
    {
      "id": "3",
      "name": "Web programiranje-Backend",
      "date": "01.05.2025",
      "duration": "30",
      "price": "350",
      "details": "Kurs je namenjen svima koji žele da se upoznaju sa najnovijim tehnologijama koji se danas korise za izradu veb sajta, a posebno onima koji vole da znaju kako program funkcioniše “ispod haube”, na backend delu veb sajta. Kurs mogu pohađati svi koji imaju dobro poznavanje osnova programiranja, sistemskog programiranja i OOP koncepata, kao i za one koje se već bave veb programiranjem i žele da prošire svoje znanje upoznajući se sa ASP.NET MVC tehnologijom, jednom od najzastupljenihjih tehnologija u svetu."
    },
    {
      "id": "4",
      "name": "Web programiranje-Frontend",
      "date": "01.05.2025",
      "duration": "30",
      "price": "350",
      "details": "Kurs frontend web programiranja je namenjen svima koji se žele baviti, ali i onima koji se već bave web programiranjem i žele da prošire svoje znanje i savladaju izradu savremenih web aplikacija koristeći najnovije tehnologije. Ovaj kurs je posebno namenjen onima koji imaju “oko za detalje” i koji vole da posvete posebnu pažnju dizajnu i funkcionalnosti klijentskog dela aplikacije"
    },
    {
      "id": "5",
      "name": "Manuelno testiranje softvera",
      "date": "15.04.2025",
      "duration": "",
      "price": "250",
      "details": "Kurs Manuelno testiranje softvera je namenjen svima koji žele da se bave manuelnim ili automatskim testiranjem Web aplikacija ili Desktop aplikacija. Kurs je prilagođen početnicima u oblasti manuelnog testiranja softvera i predstavlja odličan početak za one koji žele da se preusmere i oprobaju kao pronalazači bug-ova. Drugim rečima, ovo je kurs koji je namenjen svima koji ne vole kada neki program “baguje” i imaju želju to da promene. Naime, zadatak QA testera je upravo to – da nađe greške i disfunkcionalnosti u aplikaciji i na taj način unapredi njene performanse"
    },
    {
      "id": "6",
      "name": "Automatsko testiranje softvera",
      "date": "15.04.2025",
      "duration": "",
      "price": "250",
      "details": "Kurs Automatsko testiranje softvera je namenjen polaznicima koji žele da steknu teorijska i praktična znanja iz oblasti automatskog testiranja Web ili Desktop aplikacija. Kurs je koncipiran tako da ga mogu pratiti kako početnici u oblasti testiranja softvera, tako i oni koji već imaju predznanje iz ove oblasti, kao na primer polaznici koji su završili naš kurs Manuelno testiranje softvera."
    }
  ],
  "reservations": [
    {
      "id": "1",
      "courseName": "Manuelno testiranje softvera",
      "price": "250$",
      "name": "Prva",
      "surname": "Stavka",
      "email": "prva@mail.com",
      "comment": "Ovo je prva"
    },
    {
      "id": "2",
      "courseName": "Manuelno testiranje softvera",
      "price": "250$",
      "name": "Druga",
      "surname": "Instanca",
      "email": "druga@mail",
      "comment": "Ovo je druga"
    },
    {
      "id": "4",
      "courseName": "Osnove programiranja",
      "price": "250$",
      "name": "Probni",
      "surname": "Unos",
      "email": "proba@mail",
      "comment": "Proba prosla"
    },
    {
      "id": "5",
      "courseName": "Osnove programiranja",
      "price": "250$",
      "name": "After",
      "surname": "Errorfix",
      "email": "after@fix",
      "comment": "fixed really"
    }
  ]
}